about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-13 Mon 12:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Об олимпиадном программировании в МАИ</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Об олимпиадном программировании в МАИ</h1>
<div id="outline-container-org56c4f0e" class="outline-2">
<h2 id="org56c4f0e">Олимпиадные тренировки первого курса</h2>
<div class="outline-text-2" id="text-org56c4f0e">
<p>
Олимпиадные тренировки будут проводиться по пятницам каждую неделю с 16:30 в 444 аудитории ГУКа с переходом в 436, 438, 440.
</p>

<p>
Структура тренировок: лекция (1-1.5 часа), контест (2 часа), разбор контеста (1-1.5 часа). Самый главный этап остаётся на вас - дорешивание задач с контестов. Если что-то не получается, не стоит расстраиваться, лучше отдохнуть, возможно попробовать порешать что-то другое, и потом вернуться к дорешке.
</p>

<p>
По поводу списываний: я считаю, что списывание у студентов - ужасная болезнь, по типу чумы. На реальных олимпиадах вы не сможете копировать откуда-то чей-то код. Поэтому давайте так: во время тренировочных контестов вы можете обращаться только к лекциям или справочной информации по языку. Во время дорешивания уже можно обращаться к любым источникам, общаться друг с другом, обсуждать задачи, но ни в коем случае нельзя копировать чужой код. Код обязательно должен быть осмыслен и написан вами самими. Иначе будут баны.
</p>

<p>
Студенты со 2+ курсов также могут приходить послушать интересующие их темы.
</p>
</div>

<div id="outline-container-org56b85ff" class="outline-3">
<h3 id="org56b85ff">Темы осени</h3>
<div class="outline-text-3" id="text-org56b85ff">
<ul class="org-ul">
<li>C++ с азов до уровня написания нормальных олимпиад</li>
<li>Математика для олимпиадного программирования</li>
<li>Геометрия</li>
<li>Динамическое программирование, задача о рюкзаке</li>
<li>Общие часто встречающиеся алгоритмы на олимпиадах</li>
<li>Ним: теория Шпрага-Гранди</li>
</ul>
</div>
</div>

<div id="outline-container-orgabd448b" class="outline-3">
<h3 id="orgabd448b">Темы весны</h3>
<div class="outline-text-3" id="text-orgabd448b">
<ul class="org-ul">
<li>NP-полные задачи</li>
<li>Дерево отрезков</li>
<li>Дерево отрезков с обновлениями на отрезке</li>
<li>Графы: bfs, dfs, поиск циклов, топологическая сортировка</li>
<li>Графы: алгоритм Форда-Беллмана, Дейкстры, Флойда-Уоршелла</li>
<li>Декартово дерево</li>
<li>Остовное дерево, система непересекающихся множеств</li>
<li>Строковые алгоритмы, хеши</li>
<li>Паросочетания, потоки</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb51637d" class="outline-2">
<h2 id="orgb51637d">Тренировки и олимпиады для остальных</h2>
<div class="outline-text-2" id="text-orgb51637d">
</div>
<div id="outline-container-org2d7ad55" class="outline-3">
<h3 id="org2d7ad55">Опенкапы</h3>
<div class="outline-text-3" id="text-org2d7ad55">
<p>
Еженедельные командные (3 человека в команде) олимпиады на 5 часов по воскресеньям, в которых можно участвовать со 2 курса, либо, если вы уже можете решать сложные задачи, с первого. После них обычно бывает разбор силами самих участников. В этом году также вернётся дорешка.
</p>
</div>
</div>
<div id="outline-container-org2dd5fe8" class="outline-3">
<h3 id="org2dd5fe8">ICPC, MosCode, Чемпионат Урала и другие официальные соревнования</h3>
<div class="outline-text-3" id="text-org2dd5fe8">
<p>
Различные региональные и международные олимпиады, на которых можно что-то выиграть и получить за это кроме славы и почёта также какие-то материальные награды или возможность получить работу в крупных компаниях.
</p>
</div>
</div>
<div id="outline-container-orge753ce2" class="outline-3">
<h3 id="orge753ce2">Контесты с Codeforces, AtCoder</h3>
<div class="outline-text-3" id="text-orge753ce2">
<p>
На этих двух платформах каждую неделю проходят различные соревнования, в которых можно принимать участие для того, чтобы набраться опыта и научиться чему-то новому самостоятельно. Прошедшие контесты можно обсуждать в чатах телеграма.
</p>
</div>
</div>
</div>

<div id="outline-container-org1d53568" class="outline-2">
<h2 id="org1d53568">Что приносит олимпиадное программирование в МАИ</h2>
<div class="outline-text-2" id="text-org1d53568">
<p>
Во-первых, и самое главное - это умение писать программы разной степени сложности. Это пригождается на собеседованиях в различные компании, при решении каких-то реальных задач. Во-вторых, успешное выступление на официальных соревнованиях даёт прибавку к стипендии +7500 рублей. Еще можно немного поездить по городам (а то и странам) занимаясь олимпиадками. Кроме того, активное и достаточно успешное участие в олимпиадах и опенкапах даёт следующее внутри МАИ:
</p>
</div>
<div id="outline-container-org3d9b3d6" class="outline-3">
<h3 id="org3d9b3d6">1 курс</h3>
<div class="outline-text-3" id="text-org3d9b3d6">
<ul class="org-ul">
<li>доп. баллы на зачёты и экзамены Зайцева В.Е.</li>
<li>закрытие учебной практики</li>
</ul>
</div>
</div>
<div id="outline-container-org5b291f7" class="outline-3">
<h3 id="org5b291f7">2 курс</h3>
<div class="outline-text-3" id="text-org5b291f7">
<ul class="org-ul">
<li>закрытие учебной практики</li>
</ul>
</div>
</div>
<div id="outline-container-org3500565" class="outline-3">
<h3 id="org3500565">3 курс</h3>
<div class="outline-text-3" id="text-org3500565">
<ul class="org-ul">
<li>закрытие учебной практики</li>
<li>закрытие предмета "Уравнения математической физики"</li>
</ul>
</div>
</div>
<div id="outline-container-orgfe3eb8a" class="outline-3">
<h3 id="orgfe3eb8a">4 курс</h3>
<div class="outline-text-3" id="text-orgfe3eb8a">
<ul class="org-ul">
<li>закрытие предмета "Математическое моделирование"</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-09-13 Mon 12:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
